import ServiceCard from "../components/ServiceCard";
import { service } from "../types";

const services: service[] = [
  {
    title: "موشن غرافيك",
    description:
      "   نقوم في ماركتيف بإدارة حساباتك على مواقع التواصل الاجتماعي و إنشاء الحملات الإعلانية  في المنصات المختلفة  فهي تعتبر طريقة فعالة لجذب الجمهور المستهدف وزيادة المبيعات. نبتكر حملات إعلانية مستهدفة تستند إلى متطلبات واهتمامات الجمهور المستهدف والمنصة المستهدفة من منصات مواقع التواصل الاجتماعي مثل  سنابشات Snapchat  , فيسبوك Facebook , إنستغرام Instagram  ,تكتوك TikTok  و إكس X  وغيرها من المنصات . ",
    image: "/service.jpg",
    imageAlignment: "left",
  },
  {
    title: "دعم فني للمواقع الاكترونية",
    description:
      "   نقوم في ماركتيف بإدارة حساباتك على مواقع التواصل الاجتماعي و إنشاء الحملات الإعلانية  في المنصات المختلفة  فهي تعتبر طريقة فعالة لجذب الجمهور المستهدف وزيادة المبيعات. نبتكر حملات إعلانية مستهدفة تستند إلى متطلبات واهتمامات الجمهور المستهدف والمنصة المستهدفة من منصات مواقع التواصل الاجتماعي مثل  سنابشات Snapchat  , فيسبوك Facebook , إنستغرام Instagram  ,تكتوك TikTok  و إكس X  وغيرها من المنصات . ",
    image: "/service.jpg",
    imageAlignment: "right",
  },
  {
    title: "تصميم تطبيقات الموبايل",
    description:
      "   نقوم في ماركتيف بإدارة حساباتك على مواقع التواصل الاجتماعي و إنشاء الحملات الإعلانية  في المنصات المختلفة  فهي تعتبر طريقة فعالة لجذب الجمهور المستهدف وزيادة المبيعات. نبتكر حملات إعلانية مستهدفة تستند إلى متطلبات واهتمامات الجمهور المستهدف والمنصة المستهدفة من منصات مواقع التواصل الاجتماعي مثل  سنابشات Snapchat  , فيسبوك Facebook , إنستغرام Instagram  ,تكتوك TikTok  و إكس X  وغيرها من المنصات . ",
    image: "/service.jpg",
    imageAlignment: "left",
  },
  {
    title: "تصميم مواقع ويب",
    description:
      "   نقوم في ماركتيف بإدارة حساباتك على مواقع التواصل الاجتماعي و إنشاء الحملات الإعلانية  في المنصات المختلفة  فهي تعتبر طريقة فعالة لجذب الجمهور المستهدف وزيادة المبيعات. نبتكر حملات إعلانية مستهدفة تستند إلى متطلبات واهتمامات الجمهور المستهدف والمنصة المستهدفة من منصات مواقع التواصل الاجتماعي مثل  سنابشات Snapchat  , فيسبوك Facebook , إنستغرام Instagram  ,تكتوك TikTok  و إكس X  وغيرها من المنصات . ",
    image: "/service.jpg",
    imageAlignment: "right",
  },
  {
    title: "تصاميم وبناء هوية تجارية",
    description:
      "   نقوم في ماركتيف بإدارة حساباتك على مواقع التواصل الاجتماعي و إنشاء الحملات الإعلانية  في المنصات المختلفة  فهي تعتبر طريقة فعالة لجذب الجمهور المستهدف وزيادة المبيعات. نبتكر حملات إعلانية مستهدفة تستند إلى متطلبات واهتمامات الجمهور المستهدف والمنصة المستهدفة من منصات مواقع التواصل الاجتماعي مثل  سنابشات Snapchat  , فيسبوك Facebook , إنستغرام Instagram  ,تكتوك TikTok  و إكس X  وغيرها من المنصات . ",
    image: "/service.jpg",
    imageAlignment: "left",
  },
];

function ServicesPage() {
  return (
    <div className="w-4/5 pt-36 mx-auto">
      {services.map((service, index) => (
        <ServiceCard key={index} {...service} />
      ))}
    </div>
  );
}

export default ServicesPage;
